import { Component } from '@angular/core';

@Component({
  selector: 'app-abdomen-bodyweight',
  templateUrl: './abdomen-bodyweight.component.html',
  styleUrls: ['./abdomen-bodyweight.component.css']
})
export class AbdomenBodyweightComponent {
  exercises: any[] = [
    {
      title: 'Sit up',
      image: '../../assets/pic/abdomen-body1.jpg',
      description: 'ท่าบริหารกล้ามเนื้อหน้าท้องสุดเบสิก ถึงจะขี้เกียจมาก ๆ ท่าเล่นกล้ามท้องนี้ยังไงก็ต้องเล่น เริ่มตั้งท่าโดยนอนราบลงบนพื้นหรือเบาะออกกำลังกาย ชันเข่าทั้งสองข้างขึ้น วางมือไว้บนพื้นให้แนบไปตามข้างลำตัว หรือจะประสานไว้ที่ท้ายทอยก็ได้ แล้วค่อย ๆ ดันตัวขึ้น พร้อมเกร็งหน้าท้องส่วนบน กลับสู่ท่าเริ่มต้น'
    },
    {
      title: 'Spider crawl',
      image: '../../assets/pic/abdomen-body2.jpg',
      description: 'ท่า Spider crawl นอกจากได้เล่นกล้ามท้องแล้ว ยังได้ส่วนกล้ามเนื้อแขน หัวไหล่ และหน้าอกแถมด้วย เริ่มต้นเตรียมท่านี้โดย ตั้งท่าแบบวิดพื้น ขาเหยียดตรง ยกสะโพกขึ้น จากนั้นงอแขนลง พร้อมเกร็งหน้าท้อง แล้วยกเข่าขึ้นมาให้ถึงบริเวณข้อศอก ทำสลับขาข้างซ้ายกับขวาไปเรื่อย ๆ'
    },
    {
      title: 'Side plank',
      image: '../../assets/pic/abdomen-body3.jpg',
      description: 'หากคุณอยากกระชับส่วนกล้ามท้องให้ครบ ต้องท่า Side plank เล่นกล้ามท้องส่วนด้านข้าง (oblique) เริ่มต้นตั้งท่าด้วยการนอนตะแคงลงบนพื้นราบ โดยให้ฝั่งที่ต้องการเล่นอยู่ด้านบน ส่วนมือข้างที่อยู่ด้านบนให้วางไว้บริเวณท้ายทอย จากนั้นใช้ศอกดันลำตัวขึ้น เพื่อไม่ให้สะโพกตก ตั้งลำตัวเป็นเส้นตรง เกร็งค้างไว้ให้นานที่สุดเท่าที่จะทำได้ แล้วค่อย ๆ คลายกล้ามเนื้อหน้าท้องออก ลดลำตัวลงกลับสู่ท่าเริ่มต้น แล้วทำสลับข้างกัน'
    },
  ];
}
