import { Component } from '@angular/core';

@Component({
  selector: 'app-chest-bodyweight',
  templateUrl: './chest-bodyweight.component.html',
  styleUrls: ['./chest-bodyweight.component.css']
})
export class ChestBodyweightComponent {

  exercises: any[] = [
    {
      title: 'Push up',
      image: '../../assets/pic/chest-body1.jpg',
      description: 'ท่าวิดพื้นแบบพื้นฐาน ท่านี้จะช่วยในส่วนของอกกลาง วิธีคือ ตั้งท่าในท่านอนคว่ำแล้ววางมือระดับหัวไหล่ ขยับให้กว้างออกจากหัวไหล่เล็กน้อย วางขาแยกจากกันเล็กน้อย ใช้ปลายเท้ากดพื้นไว้ ให้รู้สึกมั่นคงเวลาดันตัวขึ้น จากนั้นก็ดันตัวขึ้นลง 8-12 ครั้ง หรือตามที่กำลังไหว ทำทั้งหมด 3 เซต '
    },
    {
      title: 'Diamond Push up',
      image: '../../assets/pic/chest-body2.jpg',
      description: 'ท่านี้จะช่วยเน้นกล้ามอกด้านใน วิธีคือ ตั้งท่าเหมือนจะวิดพื้นปกติ แต่ให้วางมือเข้ามาชิดกันมากที่สุด จากนั้นดันตัวขึ้นลง 8-12 ครั้ง หรือตามที่กำลังไหว ทำทั้งหมด 3 เซต '
    },
    {
      title: 'Decline Push up',
      image: '../../assets/pic/chest-body3.jpg',
      description: 'ท่านี้เป็นการออกกำลังกายเพื่อเน้นกล้ามอกด้านบน โดยจะต้องมีอุปกรณ์ช่วยสักหน่อย แต่เป็นอุปกรณ์ที่หาได้ทั่วไป เช่น โซฟา โต๊ะกลางที่วางหน้าทีวี เตียง เป็นต้น วิธีคือ ตั้งท่าเหมือนจะวิดพื้น แต่ให้ยกเท้าพาดขึ้นไปบนโซฟา โต๊ะ หรือขอบเตียง และวางมือในระดับหัวไหล่ แต่ให้กว้างออกจากหัวไหล่เล็กน้อย จากนั้นดันตัวขึ้นลง 8-12 ครั้ง หรือตามที่กำลังไหว ทำทั้งหมด 3 เซต '
    },
  ];

}
