import { Component } from '@angular/core';

@Component({
  selector: 'app-back-dumbbells',
  templateUrl: './back-dumbbells.component.html',
  styleUrls: ['./back-dumbbells.component.css']
})
export class BackDumbbellsComponent {

  exercises: any[] = [
    {
      title: 'Dumbbell Row',
      image: '../../assets/pic/back-dumb1.jpg',
      description: 'เริ่มต้นเตรียมดัมเบล ยืนตัวตรง วางเท้าห่างกันประมาณหัวไหล่ ถือดัมเบลไว้ข้างลำตัวคว่ำมือทั้งสองข้างที่ถือดัมเบล แอ่นอก เอียงลำตัวไปข้างหน้า 45 องศา แนวกระดูกสันหลังเป็นแนวตรง ให้กล้ามเนื้อหลังถูกเหยียดจนสุด จากนั้นออกแรงเกร็งกล้ามเนื้อหลัง เพื่อดึงดัมเบลขึ้น แล้วลดดัมเบลลงช้าๆ เพื่อกลับสู่ท่าเตรียม'
    },
    {
      title: 'Deadlift',
      image: '../../assets/pic/back-dumb2.jpg',
      description: 'ขั้นแรกยืนตรง หันหน้าเข้าหาบาร์เบล วางเท้ากว้างประมาณช่วงไหล่ แอ่นอก หลังจากนั้น ก้มลงจับบาร์ความกว้างประมาณช่วงไหล่ (คล้ายท่าสคอวซ) จากนั้นหายใจเข้าแอ่นอก พร้อมกับยกลำตัวขึ้นพร้อมบาร์เบลในลักษณะหลังตรงแอ่นอก ค้างไว้เล็กน้อย และค่อยๆลด บาร์เบล ลงช้าๆ และทำซ้ำเช่นเดิม'
    },
    {
      title: 'Dunbbell Upright Row',
      image: '../../assets/pic/back-dumb3.jpg',
      description: 'ขั้นแรกใช้มือจับดัมเบลแบบคว่ำมือ ไว้บริเวณหน้าต้นขา ระยะแคบกว่าไหล่ งอข้อศอกเล็กน้อย ลำตัวตรง ยกดัมเบลขึ้นแทงศอกออกด้านข้างในแนวดิ่งแนบลำตัว โฟกัสที่กล้ามเนื้อหลังและบ่า ดึงขึ้นมาจนใกล้ปลายคาง ค้างไว้ 2 วินาที แล้วลดดัมเบลลงช้าๆ กลับทิศทางเดิมสู่ท่าเริ่มต้น จากนั้นทำซ้ำๆ จนครบ 10-12 ครั้ง'
    },
  ];

}
